STMicroelectronics/STM32CubeH7/Projects/STM32H745I-DISCO/Demonstrations/CM7/Src/main_oscillo_cm7.c
/**
  ******************************************************************************
  * @file    Demonstration/STM32H745-Discovery_Demo/CM7/Src/main_oscillo.c
  * @author  MCD Application Team
  * @brief   This example describes how to use STM32H7 to create a digital oscilloscope
  *          able to display and detect signals with frequency up to 2 MHz.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include <stm32h7xx_hal.h>
#include "main_oscillo_cm7.h"
#include "image_oscilo.h"
#include "signals_demo.h"
#include "graphics.h"
#include <string.h>
/** @addtogroup STM32H7xx_HAL_Demonstration
  * @{
  */

/** @addtogroup Oscilloscope_SignalsGenerator
  * @{
  */


/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define PWR_WAKEUP_FLAGS  (PWR_WAKEUP_FLAG1 | PWR_WAKEUP_FLAG2 | PWR_WAKEUP_FLAG3 | \
                           PWR_WAKEUP_FLAG4 | PWR_WAKEUP_FLAG5 | PWR_WAKEUP_FLAG6)
/* Private functions ---------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
static void SystemClock_Config(void);

#if (USE_VOS0_480MHZ_OVERCLOCK == 1)
static void SystemClock_Config_480MHz(void);
#else
static void SystemClock_Config_400MHz(void);
#endif

static void MPU_Config(void);
static void CPU_CACHE_Enable(void);
static void Error_Handler(void);
static void  SG_WaveButtonCallback( void *pData);
static void SG_StartGeneratorProcess(void);
static void SG_InitGeneratorMenu(void);
/* Private variable ------------------------------------------------------------*/
BackgroundWidgetTypeDef BackgroundImage[1] = 
{
  {
    {
      BACKGROUND_IMAGE_WIDTH,  /* Width */
      BACKGROUND_IMAGE_HEIGHT, /* Height */
      BACKGROUND_IMAGE_XPOSITION,  /* Xpos */ 
      BACKGROUND_IMAGE_YPOSITION,  /* Ypos */
      DMA2D_INPUT_RGB888,   /* ColorMode */
      NULL,                   /* BackgroundImageCallback */
    },
    (uint32_t*)background/*NULL*/,
  }
};

SG_SwitchButtonWidgetTypeDef WaveButtonsTab[SG_TOTAL_WAVE_BUTTON_NBR] = 
{
  /************* Wave OFF Button  ***********/
  { 
    {
      SG_WAVE_BUTTON_WIDTH,  /* Width */
      SG_WAVE_BUTTON_HEIGHT, /* Height */
      SG_WAVE_BUTTON_XPOSITION,  /* Xpos */ 
      0,  /* Ypos */
      DMA2D_INPUT_ARGB8888,   /* ColorMode */
      SG_WaveButtonCallback  /* ButtonCallback */
    },
    (uint32_t*)(button_rectangle_dc_on), /* On_FrameBuffer */
    (uint32_t*)(button_rectangle_dc_off),  /* Off_FrameBuffer */
    BUTTON_STATE_OFF,                                  /* State */
    0,  /* LastPressTime_ticks */
    0,  /* isActive */
    SG_DC_WAVE_BUTTON_INDEX,
  },
  /************* Square Wave Button  ***********/
  { 
    {
      SG_WAVE_BUTTON_WIDTH,  /* Width */
      SG_WAVE_BUTTON_HEIGHT, /* Height */
      SG_WAVE_BUTTON_XPOSITION,  /* Xpos */ 
      0,  /* Ypos */
      DMA2D_INPUT_ARGB8888,   /* ColorMode */
      SG_WaveButtonCallback  /* ButtonCallback */
    },
    (uint32_t*)(button_rectangle_square_on), /* On_FrameBuffer */
    (uint32_t*)(button_rectangle_square_off),  /* Off_FrameBuffer */
    BUTTON_STATE_OFF,                                  /* State */
    0,  /* LastPressTime_ticks */
    0,  /* isActive */
    SG_SQUARE_WAVE_BUTTON_INDEX,
  },
  /************* Sine Wave Button  ***********/
  { 
    {
      SG_WAVE_BUTTON_WIDTH,  /* Width */
      SG_WAVE_BUTTON_HEIGHT, /* Height */
      SG_WAVE_BUTTON_XPOSITION,  /* Xpos */ 
      0,  /* Ypos */
      DMA2D_INPUT_ARGB8888,   /* ColorMode */
      SG_WaveButtonCallback  /* ButtonCallback */
    },
    (uint32_t*)(button_rectangle_sine_on), /* On_FrameBuffer */
    (uint32_t*)(button_rectangle_sine_off),  /* Off_FrameBuffer */
    BUTTON_STATE_OFF,                                  /* State */
    0,  /* LastPressTime_ticks */
    0,  /* isActive */
    SG_SINE_WAVE_BUTTON_INDEX,
  },
  /************* Triangle Wave Button  ***********/
  { 
    {
      SG_WAVE_BUTTON_WIDTH,  /* Width */
      SG_WAVE_BUTTON_HEIGHT, /* Height */
      SG_WAVE_BUTTON_XPOSITION,  /* Xpos */ 
      0,  /* Ypos */
      DMA2D_INPUT_ARGB8888,   /* ColorMode */
      SG_WaveButtonCallback  /* ButtonCallback */
    },
    (uint32_t*)(button_rectangle_triangle_on), /* On_FrameBuffer */
    (uint32_t*)(button_rectangle_triangle_off),  /* Off_FrameBuffer */
    BUTTON_STATE_OFF,                                  /* State */
    0,  /* LastPressTime_ticks */
    0,  /* isActive */
    SG_TRIANGLE_WAVE_BUTTON_INDEX,
  },
  /************* Noise Wave Button  ***********/
  { 
    {
      SG_WAVE_BUTTON_WIDTH,  /* Width */
      SG_WAVE_BUTTON_HEIGHT, /* Height */
      SG_WAVE_BUTTON_XPOSITION,  /* Xpos */ 
      0,  /* Ypos */
      DMA2D_INPUT_ARGB8888,   /* ColorMode */
      SG_WaveButtonCallback  /* ButtonCallback */
    },
    (uint32_t*)(button_rectangle_noise_on), /* On_FrameBuffer */
    (uint32_t*)(button_rectangle_noise_off),  /* Off_FrameBuffer */
    BUTTON_STATE_OFF,                                  /* State */
    0,  /* LastPressTime_ticks */
    0,  /* isActive */
    SG_NOISE_WAVE_BUTTON_INDEX,
  },
  /************* Escalator Wave Button  ***********/
  { 
    {
      SG_WAVE_BUTTON_WIDTH,  /* Width */
      SG_WAVE_BUTTON_HEIGHT, /* Height */
      SG_WAVE_BUTTON_XPOSITION,  /* Xpos */ 
      0,  /* Ypos */
      DMA2D_INPUT_ARGB8888,   /* ColorMode */
      SG_WaveButtonCallback  /* ButtonCallback */
    },
    (uint32_t*)(button_rectangle_escalator_on), /* On_FrameBuffer */
    (uint32_t*)(button_rectangle_escalator_off),  /* Off_FrameBuffer */
    BUTTON_STATE_OFF,                                  /* State */
    0,  /* LastPressTime_ticks */
    0,  /* isActive */
    SG_ESCALATOR_WAVE_BUTTON_INDEX,
  }  

